"use strict";
// 'Interface - має описувати структуру об'єктів, їхні методи та властивості. Інтерфейси переважно призначені для опису класів. Через це вони не можуть зберігати в собі примітивні значення, як це може робити Type, а також масиви та інші структури даних, які не є об'єктами. Ми просто не зможемо їх туди зберегти, оскільки за синтаксисом відразу йдуть фігурні дужки {}.
const dog = {
    name: 'Fido',
    age: 5,
    bark: 'bow'
};
const puppy = {
    name: 'Fido',
    age: 5,
};
//# sourceMappingURL=03-interfaces-vs-aliases.js.map